import os

# 디버그 모드 설정 (True일 경우 추가 로그나 디버그용 UI 표시)
IS_DEBUG_MODE = True

# 애플리케이션 정보
APP_NAME = "DataDic"
APP_VERSION = "1.0.0"

# 기본 경로 설정
BASE_DIR = os.path.dirname(os.path.abspath(__file__))

# 글로벌 설정 DB 경로
GLOBAL_CONFIG_DB_PATH = r"c:\gndq\gndq.db"

# 생성할 기본 폴더 구조 정의
DEFAULT_PROJECT_FOLDERS = [
    '01_감리계획서_템플릿',
    '02_수령산출물',
    '03_추가수령산출물',
    '07_점검_요구사항',
    '08_점검_데이터',
    '09_감리보고서',
    '11_시정조치_템플릿',
    '12_시정조치_수령산출물',
    '18_시정조치_점검',
    '19_시정조치_보고서'
]

# 기본 데이터 품질 점검 룰 정의
DEFAULT_DQ_RULES = [
    ('ruleset_1', '문자열', 1, '', '[A-Za-z]', 'C', ''),
    ('ruleset_1', '문자열', 2, '', '[가-힣]', 'ㅎ', ''),
    ('ruleset_2', '문자열-숫자포함', 1, '', '[A-Za-z]', 'C', ''),
    ('ruleset_2', '문자열-숫자포함', 2, '', '[가-힣]', 'ㅎ', ''),
    ('ruleset_2', '문자열-숫자포함', 3, '', '[0-9]', '9', ''),
    ('rule_1', 'DT', 1, '일시 형식(YYYY-MM-DD HH:mm:ss) 점검', r'^(((?:19\d{2}|20\d{2})-(?:0[1-9]|1[0-2])-(?:[0-2]\d|3[01])) (?:[01]\d|2[0-3]):(?:[0-5][0-9]):(?:[0-5][0-9]))$', '$1', '사용자 요청 일시 패턴'),
    ('rule_2', 'Email', 1, '이메일 형식 점검', r'^([a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,})$', '$1', '형식 불일치 시 false 반환'),
    ('rule_3', 'YMD', 1, '날짜 형식(YYYYMMDD) 점검', r'^((?:19\d{2}|20\d{2})(?:0[1-9]|1[0-2])(?:[0-2]\d|3[01]))$', '$1', ''),
    ('rule_4', 'YN', 1, '여부', r'^([YN])$', '$1', 'Y 또는 N'),
    ('rule_5', 'YR', 1, '년도', r'^((?:19\d{2}|20\d{2}))$', '$1', '')
]

# UI 관련 설정
THEME_COLOR = "#FF4B4B"
